In [98]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [99]:
%sql mysql+mysqlconnector://root:1234@localhost/demo

In [101]:
%%sql
use database demo;

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'database demo' at line 1
[SQL: use database demo;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
CREATE TABLE trial (
    id INT PRIMARY KEY AUTO_INCREMENT,   -- Unique ID for each row
    name VARCHAR(100) NOT NULL,          -- Name field
    age INT,                             -- Age field
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP  -- Record creation time
);

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'trial' already exists
[SQL: CREATE TABLE trial (
    id INT PRIMARY KEY AUTO_INCREMENT,   -- Unique ID for each row
    name VARCHAR(100) NOT NULL,          -- Name field
    age INT,                             -- Age field
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP  -- Record creation time
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql 

INSERT INTO trial (name, age) 
VALUES 
('Alice', 25),
('Bob', 30),
('Charlie', 28),
('Diana', 35);

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[]

In [5]:
%%sql 
select * from trial;

 * mysql+mysqlconnector://root:***@localhost/demo
8 rows affected.

[(1, 'Alice', 25, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (2, 'Bob', 30, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (3, 'Charlie', 28, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (4, 'Diana', 35, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (5, 'Alice', 25, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (6, 'Bob', 30, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (7, 'Charlie', 28, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (8, 'Diana', 35, datetime.datetime(2025, 9, 9, 14, 26, 19))]

In [14]:
%%sql 
select name from trial where age not in (25, 30);

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[('Charlie',), ('Diana',), ('Charlie',), ('Diana',)]

case when

In [18]:
%%sql
SELECT CASE 
         WHEN 8>10 THEN 'true'
         ELSE 'false'
       END AS result;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[('false',)]

In [20]:
%%sql
select 
case
    when 8>10 then 'true'
    when 10>8 then 'yes'
    else 'false'
end as test;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[('yes',)]

In [34]:
%%sql
drop table if exists customertransactions;
CREATE TABLE customertransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(45),
    product VARCHAR(100),
    amount DECIMAL(10,2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.

[]

In [36]:
%%sql
INSERT INTO customertransactions (id, login_device, customer_name, ip_address, product, amount, is_placed, is_viewed, transaction_status) VALUES
(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', 1200.50, TRUE, TRUE, 'Completed'),
(2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', 800.00, FALSE, TRUE, 'Pending'),
(3, 'Tablet', 'Charlie Brown', '192.168.1.3', 'Headphones', 150.75, TRUE, FALSE, 'Cancelled'),
(4, 'Mobile', 'Diana Prince', '192.168.1.4', 'Camera', 500.00, TRUE, TRUE, 'Completed'),
(5, 'Desktop', 'Ethan Hunt', '192.168.1.5', 'Monitor', 250.00, FALSE, TRUE, 'Pending'),
(6, 'Mobile', 'Fiona Gallagher', '192.168.1.6', 'Keyboard', 75.25, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'George Clooney', '192.168.1.7', 'Mouse', 50.50, TRUE, FALSE, 'Cancelled'),
(8, 'Desktop', 'Hannah Montana', '192.168.1.8', 'Printer', 300.00, FALSE, TRUE, 'Pending'),
(9, 'Mobile', 'Ian Somerhalder', '192.168.1.9', 'Tablet', 400.00, TRUE, TRUE, 'Completed'),
(10, 'Desktop', 'Jane Doe', '192.168.1.10', 'Speakers', 120.00, FALSE, TRUE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[]

In [37]:
%%sql
SELECT * FROM customertransactions;

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', Decimal('1200.50'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', Decimal('800.00'), 0, 1, 'Pending'),
 (3, 'Tablet', 'Charlie Brown', '192.168.1.3', 'Headphones', Decimal('150.75'), 1, 0, 'Cancelled'),
 (4, 'Mobile', 'Diana Prince', '192.168.1.4', 'Camera', Decimal('500.00'), 1, 1, 'Completed'),
 (5, 'Desktop', 'Ethan Hunt', '192.168.1.5', 'Monitor', Decimal('250.00'), 0, 1, 'Pending'),
 (6, 'Mobile', 'Fiona Gallagher', '192.168.1.6', 'Keyboard', Decimal('75.25'), 1, 1, 'Completed'),
 (7, 'Tablet', 'George Clooney', '192.168.1.7', 'Mouse', Decimal('50.50'), 1, 0, 'Cancelled'),
 (8, 'Desktop', 'Hannah Montana', '192.168.1.8', 'Printer', Decimal('300.00'), 0, 1, 'Pending'),
 (9, 'Mobile', 'Ian Somerhalder', '192.168.1.9', 'Tablet', Decimal('400.00'), 1, 1, 'Completed'),
 (10, 'Desktop', 'Jane Doe', '192.168.1.10', 'Speakers', Decimal('120.00'), 0, 1, 'Pending')]

In [41]:
%%sql
select * from customertransactions limit 2;

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', Decimal('1200.50'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', Decimal('800.00'), 0, 1, 'Pending')]

In [40]:
%%sql 
select customer_name, product, amount,
case 
    when amount>1000 then 'high spend'
    when amount between 500 and 1000 then 'medium spend'
    else 'low spend'
end as spend_category
from customertransactions

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[('Alice Johnson', 'Laptop', Decimal('1200.50'), 'high spend'),
 ('Bob Smith', 'Smartphone', Decimal('800.00'), 'medium spend'),
 ('Charlie Brown', 'Headphones', Decimal('150.75'), 'low spend'),
 ('Diana Prince', 'Camera', Decimal('500.00'), 'medium spend'),
 ('Ethan Hunt', 'Monitor', Decimal('250.00'), 'low spend'),
 ('Fiona Gallagher', 'Keyboard', Decimal('75.25'), 'low spend'),
 ('George Clooney', 'Mouse', Decimal('50.50'), 'low spend'),
 ('Hannah Montana', 'Printer', Decimal('300.00'), 'low spend'),
 ('Ian Somerhalder', 'Tablet', Decimal('400.00'), 'low spend'),
 ('Jane Doe', 'Speakers', Decimal('120.00'), 'low spend')]

null handling

In [42]:
%%sql
CREATE TABLE customers (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100) NULL,
    email VARCHAR(100) NULL,
    phone_number VARCHAR(20) NULL,
    address VARCHAR(100) NULL,
    amount DECIMAL(10,2) NULL
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [43]:
%%sql
INSERT INTO customers (id, customer_name, email, phone_number, address, amount) VALUES
(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', 1200.50),
(2, 'Bob Smith', NULL, '9123456780', 'Bangalore', 800.00),
(3, NULL, 'charlie@example.com', NULL, 'Chennai', NULL),
(4, 'Diana Prince', 'diana@example.com', '9988776655', NULL, 500.00),
(5, 'Ethan Hunt', NULL, NULL, 'Bangalore', NULL);

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [44]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', Decimal('1200.50')),
 (2, 'Bob Smith', None, '9123456780', 'Bangalore', Decimal('800.00')),
 (3, None, 'charlie@example.com', None, 'Chennai', None),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None, Decimal('500.00')),
 (5, 'Ethan Hunt', None, None, 'Bangalore', None)]

In [46]:
%%sql
select count(*) from customers where phone_number is null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(2,)]

In [47]:
%%sql 
select count(*) from customers where phone_number is not null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(3,)]

In [54]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    or phone_number is null
    or address is null;

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(2, 'Bob Smith', None, '9123456780', 'Bangalore'),
 (3, None, 'charlie@example.com', None, 'Chennai'),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None),
 (5, 'Ethan Hunt', None, None, 'Bangalore')]

In [55]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    and phone_number is null
    and address is null;

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [56]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    and phone_number is null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(5, 'Ethan Hunt', None, None, 'Bangalore')]

In [58]:
%%sql
SELECT id,customer_name,amount,
coalesce(amount,'0.00')
from customers

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', Decimal('1200.50'), '1200.50'),
 (2, 'Bob Smith', Decimal('800.00'), '800.00'),
 (3, None, None, '0.00'),
 (4, 'Diana Prince', Decimal('500.00'), '500.00'),
 (5, 'Ethan Hunt', None, '0.00')]

string handling

In [5]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', Decimal('1200.50')),
 (2, 'Bob Smith', None, '9123456780', 'Bangalore', Decimal('800.00')),
 (3, None, 'charlie@example.com', None, 'Chennai', None),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None, Decimal('500.00')),
 (5, 'Ethan Hunt', None, None, 'Bangalore', None)]

In [70]:
%%sql

select
length(customer_name) as name_length,
upper(address) as upper_city,
lower(customer_name) as lower_name,
concat(customer_name,'-',address,'-','TN') as name_c,
substring(customer_name,1,3) as name_sub,
trim('   chennai   ') as trimmed_city,
lpad(address,10,'*') as padded_address,
rpad(address,10,'#') as rpad_address,
replace(customer_name,' ','_') as updated_name,
instr(customer_name,'a') as position_a

from customers

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(13, 'CHENNAI', 'alice johnson', 'Alice Johnson-Chennai-TN', 'Ali', 'chennai', '***Chennai', 'Chennai###', 'Alice_Johnson', 1),
 (9, 'BANGALORE', 'bob smith', 'Bob Smith-Bangalore-TN', 'Bob', 'chennai', '*Bangalore', 'Bangalore#', 'Bob_Smith', 0),
 (None, 'CHENNAI', None, None, None, 'chennai', '***Chennai', 'Chennai###', None, None),
 (12, None, 'diana prince', None, 'Dia', 'chennai', None, None, 'Diana_Prince', 3),
 (10, 'BANGALORE', 'ethan hunt', 'Ethan Hunt-Bangalore-TN', 'Eth', 'chennai', '*Bangalore', 'Bangalore#', 'Ethan_Hunt', 4)]

subQuery

In [6]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', Decimal('1200.50')),
 (2, 'Bob Smith', None, '9123456780', 'Bangalore', Decimal('800.00')),
 (3, None, 'charlie@example.com', None, 'Chennai', None),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None, Decimal('500.00')),
 (5, 'Ethan Hunt', None, None, 'Bangalore', None)]

In [14]:
%%sql
 select max(amount) as second from customers
where amount< (select max(amount) from customers);

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(Decimal('800.00'),)]

In [29]:
%%sql

CREATE TABLE orders (
    order_id INT PRIMARY KEY AUTO_INCREMENT,
    id INT,
    product_name VARCHAR(100),
    quantity INT,
    order_amount DECIMAL(10,2),
    order_date DATE,
    FOREIGN KEY (id) REFERENCES customers(id)
);

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'orders' already exists
[SQL: CREATE TABLE orders (
    order_id INT PRIMARY KEY AUTO_INCREMENT,
    id INT,
    product_name VARCHAR(100),
    quantity INT,
    order_amount DECIMAL(10,2),
    order_date DATE,
    FOREIGN KEY (id) REFERENCES customers(id)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [30]:
%%sql
INSERT INTO orders (id, product_name, quantity, order_amount, order_date) VALUES
(1, 'Laptop', 1, 1200.50, '2025-09-10'),
(2, 'Mobile Phone', 2, 1600.00, '2025-09-09'),
(3, 'Headphones', 1, 200.00, '2025-09-08'),
(4, 'Smartwatch', 1, 500.00, '2025-09-07'),
(5, 'Tablet', 3, 2400.00, '2025-09-06');

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [31]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[(1, 1, 'Laptop', 1, Decimal('1200.50'), datetime.date(2025, 9, 10)),
 (2, 2, 'Mobile Phone', 2, Decimal('1600.00'), datetime.date(2025, 9, 9)),
 (3, 3, 'Headphones', 1, Decimal('200.00'), datetime.date(2025, 9, 8)),
 (4, 4, 'Smartwatch', 1, Decimal('500.00'), datetime.date(2025, 9, 7)),
 (5, 5, 'Tablet', 3, Decimal('2400.00'), datetime.date(2025, 9, 6)),
 (6, 1, 'Laptop', 1, Decimal('1200.50'), datetime.date(2025, 9, 10)),
 (7, 2, 'Mobile Phone', 2, Decimal('1600.00'), datetime.date(2025, 9, 9)),
 (8, 3, 'Headphones', 1, Decimal('200.00'), datetime.date(2025, 9, 8)),
 (9, 4, 'Smartwatch', 1, Decimal('500.00'), datetime.date(2025, 9, 7)),
 (10, 5, 'Tablet', 3, Decimal('2400.00'), datetime.date(2025, 9, 6))]

In [33]:
%%sql
SELECT 
    c.customer_name,
    c.address AS city,
    (SELECT SUM(o.order_amount) 
     FROM orders o 
     WHERE o.id = c.id) AS total_orders
FROM customers c;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Alice Johnson', 'Chennai', Decimal('2401.00')),
 ('Bob Smith', 'Bangalore', Decimal('3200.00')),
 (None, 'Chennai', Decimal('400.00')),
 ('Diana Prince', None, Decimal('1000.00')),
 ('Ethan Hunt', 'Bangalore', Decimal('4800.00'))]

In [34]:
%%sql
select 
customer_name,
case 
    when(select sum(order_amount) from orders where orders.id=customers.id) >
    (select avg(order_amount) from orders) then 'high value customer'
    else 'regular customer'
end as customer_type
from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Alice Johnson', 'high value customer'),
 ('Bob Smith', 'high value customer'),
 (None, 'regular customer'),
 ('Diana Prince', 'regular customer'),
 ('Ethan Hunt', 'high value customer')]

In [37]:
%%sql
create table employees(
    employee_id int primary key,
    first_name varchar(50),
    last_name varchar(50),
    email varchar(50),
    hire_date DATE,
    job_title varchar(50),
    salary decimal(20,2)
);
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary) VALUES
(1, 'Alice', 'Johnson', 'alice.johnson@example.com', '2020-03-15', 'Data Analyst', 60000.00),
(2, 'Bob', 'Smith', 'bob.smith@example.com', '2019-07-10', 'Software Engineer', 75000.00),
(3, 'Charlie', 'Brown', 'charlie.brown@example.com', '2021-01-20', 'HR Manager', 50000.00),
(4, 'Diana', 'Prince', 'diana.prince@example.com', '2018-11-05', 'Project Manager', 90000.00),
(5, 'Ethan', 'Hunt', 'ethan.hunt@example.com', '2022-06-12', 'Business Analyst', 65000.00),
(6, 'Fiona', 'Clark', 'fiona.clark@example.com', '2020-09-25', 'UI/UX Designer', 55000.00),
(7, 'George', 'Miller', 'george.miller@example.com', '2017-02-18', 'Senior Developer', 100000.00),
(8, 'Hannah', 'Davis', 'hannah.davis@example.com', '2019-12-01', 'QA Engineer', 58000.00),
(9, 'Ian', 'Wright', 'ian.wright@example.com', '2021-05-30', 'DevOps Engineer', 72000.00),
(10, 'Julia', 'Taylor', 'julia.taylor@example.com', '2023-04-01', 'Intern', 30000.00);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
10 rows affected.

[]

In [38]:
%%sql
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[(1, 'Alice', 'Johnson', 'alice.johnson@example.com', datetime.date(2020, 3, 15), 'Data Analyst', Decimal('60000.00')),
 (2, 'Bob', 'Smith', 'bob.smith@example.com', datetime.date(2019, 7, 10), 'Software Engineer', Decimal('75000.00')),
 (3, 'Charlie', 'Brown', 'charlie.brown@example.com', datetime.date(2021, 1, 20), 'HR Manager', Decimal('50000.00')),
 (4, 'Diana', 'Prince', 'diana.prince@example.com', datetime.date(2018, 11, 5), 'Project Manager', Decimal('90000.00')),
 (5, 'Ethan', 'Hunt', 'ethan.hunt@example.com', datetime.date(2022, 6, 12), 'Business Analyst', Decimal('65000.00')),
 (6, 'Fiona', 'Clark', 'fiona.clark@example.com', datetime.date(2020, 9, 25), 'UI/UX Designer', Decimal('55000.00')),
 (7, 'George', 'Miller', 'george.miller@example.com', datetime.date(2017, 2, 18), 'Senior Developer', Decimal('100000.00')),
 (8, 'Hannah', 'Davis', 'hannah.davis@example.com', datetime.date(2019, 12, 1), 'QA Engineer', Decimal('58000.00')),
 (9, 'Ian', 'Wright', 'ian.wright@example.com', datetime.date(2021, 5, 30), 'DevOps Engineer', Decimal('72000.00')),
 (10, 'Julia', 'Taylor', 'julia.taylor@example.com', datetime.date(2023, 4, 1), 'Intern', Decimal('30000.00'))]

In [39]:
%%sql
create view high_earners AS
select first_name, last_name,employee_id, job_title, salary
from employees
where salary>70000;

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [42]:
%%sql
select * from high_earners;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Bob', 'Smith', 2, 'Software Engineer', Decimal('75000.00')),
 ('Diana', 'Prince', 4, 'Project Manager', Decimal('90000.00')),
 ('George', 'Miller', 7, 'Senior Developer', Decimal('100000.00')),
 ('Ian', 'Wright', 9, 'DevOps Engineer', Decimal('72000.00')),
 ('Kevin', 'Anderson', 11, 'Data Scientist', Decimal('120000.00'))]

In [41]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary) VALUES
(11, 'Kevin', 'Anderson', 'kevin.anderson@example.com', '2024-02-15', 'Data Scientist', 120000.00);

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[]

Joins

In [44]:
%%sql   
drop table if exists restarunts;
create table restarunts(
    id int primary key,
    name varchar(50) not null ,
    location varchar(100)not null
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.

[]

In [46]:
%%sql
INSERT INTO restarunts (id, name, location) VALUES
(1, 'Spice Garden', 'Chennai'),
(2, 'Urban Tandoor', 'Bangalore'),
(3, 'The Food Lounge', 'Hyderabad'),
(4, 'Coastal Flavors', 'Kochi'),
(5, 'Royal Biryani House', 'Delhi');

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [65]:
%%sql 
select * from restarunts;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Spice Garden', 'Chennai'),
 (2, 'Urban Tandoor', 'Bangalore'),
 (3, 'The Food Lounge', 'Hyderabad'),
 (4, 'Coastal Flavors', 'Kochi'),
 (5, 'Royal Biryani House', 'Delhi')]

In [45]:
%%sql
create table food_order(
    order_id int primary key,
    restaurant_id int not null,
    order_date date not null
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [60]:
%%sql
INSERT INTO food_order (order_id, restaurant_id, order_date) VALUES
(101, 1, '2025-09-01'),
(102, 2, '2025-09-02'),
(103, 3, '2025-09-03'),
(104, 1, '2025-09-04'),
(105, 5, '2025-09-05'),
(106, 5, '2025-09-06');

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '101' for key 'food_order.PRIMARY'
[SQL: INSERT INTO food_order (order_id, restaurant_id, order_date) VALUES
(101, 1, '2025-09-01'),
(102, 2, '2025-09-02'),
(103, 3, '2025-09-03'),
(104, 1, '2025-09-04'),
(105, 5, '2025-09-05'),
(106, 5, '2025-09-06');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [61]:
%%sql 
select * from restarunts;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Spice Garden', 'Chennai'),
 (2, 'Urban Tandoor', 'Bangalore'),
 (3, 'The Food Lounge', 'Hyderabad'),
 (4, 'Coastal Flavors', 'Kochi'),
 (5, 'Royal Biryani House', 'Delhi')]

In [62]:
%%sql
select * from food_order;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(101, 1, datetime.date(2025, 9, 1)),
 (102, 2, datetime.date(2025, 9, 2)),
 (103, 3, datetime.date(2025, 9, 3)),
 (104, 1, datetime.date(2025, 9, 4)),
 (105, 5, datetime.date(2025, 9, 5))]

inner join or join

In [54]:
%%sql
select 
r.name as restaurant_name,
f.order_date

from restarunts r
inner join food_order f
on r.id=f.restaurant_id;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Spice Garden', datetime.date(2025, 9, 1)),
 ('Urban Tandoor', datetime.date(2025, 9, 2)),
 ('The Food Lounge', datetime.date(2025, 9, 3)),
 ('Spice Garden', datetime.date(2025, 9, 4)),
 ('Royal Biryani House', datetime.date(2025, 9, 5))]

left join

In [55]:
%%sql
select 
r.name as restaurant_name,
f.order_date

from restarunts r
left join food_order f
on r.id=f.restaurant_id;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[('Spice Garden', datetime.date(2025, 9, 4)),
 ('Spice Garden', datetime.date(2025, 9, 1)),
 ('Urban Tandoor', datetime.date(2025, 9, 2)),
 ('The Food Lounge', datetime.date(2025, 9, 3)),
 ('Coastal Flavors', None),
 ('Royal Biryani House', datetime.date(2025, 9, 5))]

right join

In [63]:
%%sql
select 
r.name as restaurant_name,
f.order_date

from restarunts r
right join food_order f
on r.id=f.restaurant_id;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Spice Garden', datetime.date(2025, 9, 1)),
 ('Urban Tandoor', datetime.date(2025, 9, 2)),
 ('The Food Lounge', datetime.date(2025, 9, 3)),
 ('Spice Garden', datetime.date(2025, 9, 4)),
 ('Royal Biryani House', datetime.date(2025, 9, 5))]

self join

In [66]:
%%sql
CREATE TABLE office (
    employee_id INT PRIMARY KEY,
    name VARCHAR(50),
    manager_id INT
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [76]:
%%sql
INSERT INTO office (employee_id, name, manager_id) VALUES
(1, 'Alice', NULL),       
(2, 'Bob', 1),            
(3, 'Charlie', 1),        
(4, 'Diana', 2),          
(5, 'Ethan', 2),          
(6, 'Fiona', 3);

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[]

In [77]:
%%sql
select * from office;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', None),
 (2, 'Bob', 1),
 (3, 'Charlie', 1),
 (4, 'Diana', 2),
 (5, 'Ethan', 2),
 (6, 'Fiona', 3)]

In [78]:
%%sql   
select 
    e.name as employee_name,
    m.name as manager_name
from office e
join office m
on e.manager_id=m.employee_id;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Bob', 'Alice'),
 ('Charlie', 'Alice'),
 ('Diana', 'Bob'),
 ('Ethan', 'Bob'),
 ('Fiona', 'Charlie')]

window function

In [79]:
%%sql
create table sales(
    transaction_id int,
    store varchar(50),
    salesamount decimal(10,2)
)

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [80]:
%%sql
insert into sales(transaction_id,store,salesamount) values
(1,'A',100.00),
(2,'A',200.00),
(3,'A',150.00),
(4,'B',250.00),
(5,'B',300.00);

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [82]:
%%sql
select store,sum(salesamount) from sales
group by store;

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[('A', Decimal('450.00')), ('B', Decimal('550.00'))]

In [86]:
%%sql
select transaction_id,store,salesamount,
sum(salesamount) over() as total_sales
from sales;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('1000.00')),
 (2, 'A', Decimal('200.00'), Decimal('1000.00')),
 (3, 'A', Decimal('150.00'), Decimal('1000.00')),
 (4, 'B', Decimal('250.00'), Decimal('1000.00')),
 (5, 'B', Decimal('300.00'), Decimal('1000.00'))]

In [87]:
%%sql
select transaction_id,store,salesamount,
sum(salesamount) over(partition by store) as total_sales
from sales;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('450.00')),
 (2, 'A', Decimal('200.00'), Decimal('450.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('550.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [85]:
%%sql
select transaction_id,store,salesamount,
sum(salesamount) over(partition by store order by transaction_id desc) as total_sales
from sales;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(3, 'A', Decimal('150.00'), Decimal('150.00')),
 (2, 'A', Decimal('200.00'), Decimal('350.00')),
 (1, 'A', Decimal('100.00'), Decimal('450.00')),
 (5, 'B', Decimal('300.00'), Decimal('300.00')),
 (4, 'B', Decimal('250.00'), Decimal('550.00'))]

row number

In [89]:
%%sql
select *,
row_number() over(order by salesamount desc) as row_num
from sales;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(5, 'B', Decimal('300.00'), 1),
 (4, 'B', Decimal('250.00'), 2),
 (2, 'A', Decimal('200.00'), 3),
 (3, 'A', Decimal('150.00'), 4),
 (1, 'A', Decimal('100.00'), 5)]

In [90]:
%%sql
select *,
row_number() over(partition by store order by salesamount desc) as row_num
from sales;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(2, 'A', Decimal('200.00'), 1),
 (3, 'A', Decimal('150.00'), 2),
 (1, 'A', Decimal('100.00'), 3),
 (5, 'B', Decimal('300.00'), 1),
 (4, 'B', Decimal('250.00'), 2)]

In [93]:
%%sql
create table emp_details(
    emp_id int,
    emp_name varchar(50),
    department varchar(50),
    hire_date date
);
insert into emp_details(emp_id,emp_name,department,hire_date) values
(1,'Alice','HR','2020-01-15'),
(1,'Alice','HR','2022-01-15'),
(2,'Charlie','Finance','2021-07-30'),
(3,'Diana','IT','2018-11-05'),
(3,'Diana','IT','2020-11-05')

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'emp_details' already exists
[SQL: create table emp_details(
    emp_id int,
    emp_name varchar(50),
    department varchar(50),
    hire_date date
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [94]:
%%sql
select * from emp_details;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 1, 15)),
 (1, 'Alice', 'HR', datetime.date(2022, 1, 15)),
 (2, 'Charlie', 'Finance', datetime.date(2021, 7, 30)),
 (3, 'Diana', 'IT', datetime.date(2018, 11, 5)),
 (3, 'Diana', 'IT', datetime.date(2020, 11, 5))]

In [95]:
%%sql
select *,
row_number() over(partition by emp_id order by hire_date asc) as row_num
from emp_details;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 1, 15), 1),
 (1, 'Alice', 'HR', datetime.date(2022, 1, 15), 2),
 (2, 'Charlie', 'Finance', datetime.date(2021, 7, 30), 1),
 (3, 'Diana', 'IT', datetime.date(2018, 11, 5), 1),
 (3, 'Diana', 'IT', datetime.date(2020, 11, 5), 2)]

In [99]:
%%sql
with ranked_employees as (
    select emp_id,emp_name,department,hire_date,
    row_number() over(partition by emp_id order by hire_date asc) as row_num
    from emp_details
)
select emp_id,emp_name,department,hire_date from ranked_employees where row_num=1;

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 1, 15)),
 (2, 'Charlie', 'Finance', datetime.date(2021, 7, 30)),
 (3, 'Diana', 'IT', datetime.date(2018, 11, 5))]

Rank and dense rank

In [100]:
%%sql
create table students(
    std_id int,
    std_name varchar(50),
    examscore int
);
insert into students(std_id,std_name,examscore) values
(1,'Alice',85),
(2,'Bob',90),
(3,'Charlie',85),
(4,'Diana',95),
(5,'Ethan',90);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
5 rows affected.

[]

In [119]:
%%sql 
insert into students(std_id,std_name,examscore) values
(6,'Alice',80);

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[]

In [7]:
%%sql
select * from students;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', 85),
 (2, 'Bob', 90),
 (3, 'Charlie', 85),
 (4, 'Diana', 95),
 (5, 'Ethan', 90),
 (6, 'Alice', 80)]

In [8]:
%%sql
select std_id,std_name,examscore,
rank() over(order by examscore desc) as rank_no
from students;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(4, 'Diana', 95, 1),
 (2, 'Bob', 90, 2),
 (5, 'Ethan', 90, 2),
 (1, 'Alice', 85, 4),
 (3, 'Charlie', 85, 4),
 (6, 'Alice', 80, 6)]

In [9]:
%%sql
SELECT std_id,std_name,examscore,
dense_rank() OVER (ORDER BY examscore DESC) AS rank_no
FROM students;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(4, 'Diana', 95, 1),
 (2, 'Bob', 90, 2),
 (5, 'Ethan', 90, 2),
 (1, 'Alice', 85, 3),
 (3, 'Charlie', 85, 3),
 (6, 'Alice', 80, 4)]

percent rank

In [11]:
%%sql
SELECT std_id,std_name,examscore,
percent_rank() OVER (ORDER BY examscore DESC) AS rankpercent
FROM students;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(4, 'Diana', 95, 0.0),
 (2, 'Bob', 90, 0.2),
 (5, 'Ethan', 90, 0.2),
 (1, 'Alice', 85, 0.6),
 (3, 'Charlie', 85, 0.6),
 (6, 'Alice', 80, 1.0)]

Ntile

In [12]:
%%sql
create table emp_sales(
    emp_id int,
    emp_name varchar(50),
    sales_amt decimal(10,2)
);
insert into emp_sales(emp_id,emp_name,sales_amt) values
(1,'Alice',500.00),
(2,'Bob',700.00),
(3,'Charlie',600.00),
(4,'Diana',800.00),
(5,'Ethan',900.00),
(6,'Fiona',400.00),
(7,'George',300.00),
(8,'Hannah',200.00),
(9,'Ian',100.00),
(10,'Jane',50.00);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
10 rows affected.

[]

In [13]:
%%sql
select *,ntile(4) over(order by sales_amt desc) as perform
from emp_sales;

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[(5, 'Ethan', Decimal('900.00'), 1),
 (4, 'Diana', Decimal('800.00'), 1),
 (2, 'Bob', Decimal('700.00'), 1),
 (3, 'Charlie', Decimal('600.00'), 2),
 (1, 'Alice', Decimal('500.00'), 2),
 (6, 'Fiona', Decimal('400.00'), 2),
 (7, 'George', Decimal('300.00'), 3),
 (8, 'Hannah', Decimal('200.00'), 3),
 (9, 'Ian', Decimal('100.00'), 4),
 (10, 'Jane', Decimal('50.00'), 4)]

value

lag

In [14]:
%%sql
create table emp_salary_history(
    emp_id int,
    emp_name varchar(50),
    salary decimal(10,2)
);
insert into emp_salary_history(emp_id,emp_name,salary) values
(1,'Alice',60000.00),
(1,'Alice',65000.00),
(2,'Bob',75000.00),
(2,'Bob',80000.00),
(3,'Charlie',50000.00),
(3,'Charlie',55000.00);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
6 rows affected.

[]

In [16]:
%%sql
select *,
lag(salary) over(partition by emp_id order by salary) as salary_change
from emp_salary_history;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', Decimal('60000.00'), None),
 (1, 'Alice', Decimal('65000.00'), Decimal('60000.00')),
 (2, 'Bob', Decimal('75000.00'), None),
 (2, 'Bob', Decimal('80000.00'), Decimal('75000.00')),
 (3, 'Charlie', Decimal('50000.00'), None),
 (3, 'Charlie', Decimal('55000.00'), Decimal('50000.00'))]

In [18]:
%%sql
select *,
lag(salary) over(partition by emp_id order by salary) as salary_change,
salary - lag(salary) over(partition by emp_id order by salary) as change_amount
from emp_salary_history;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', Decimal('60000.00'), None, None),
 (1, 'Alice', Decimal('65000.00'), Decimal('60000.00'), Decimal('5000.00')),
 (2, 'Bob', Decimal('75000.00'), None, None),
 (2, 'Bob', Decimal('80000.00'), Decimal('75000.00'), Decimal('5000.00')),
 (3, 'Charlie', Decimal('50000.00'), None, None),
 (3, 'Charlie', Decimal('55000.00'), Decimal('50000.00'), Decimal('5000.00'))]

lead

In [22]:
%%sql
create table product_sale(
    product_id int,
    product_name varchar(50),
    sale_amount decimal(10,2),sale_date date
);
insert into product_sale(product_id,product_name,sale_date,sale_amount) values
(1,'mobile','2025-09-01',500.00),
(1,'mobile','2025-09-02',600.00),
(1,'mobile','2025-09-03',700.00),
(1,'mobile','2025-09-04',800.00);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
4 rows affected.

[]

In [23]:
%%sql
select product_id,product_name,sale_date,sale_amount,
lead(sale_amount) over(order by sale_amount) as nextsale_amount
from product_sale;

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(1, 'mobile', datetime.date(2025, 9, 1), Decimal('500.00'), Decimal('600.00')),
 (1, 'mobile', datetime.date(2025, 9, 2), Decimal('600.00'), Decimal('700.00')),
 (1, 'mobile', datetime.date(2025, 9, 3), Decimal('700.00'), Decimal('800.00')),
 (1, 'mobile', datetime.date(2025, 9, 4), Decimal('800.00'), None)]

In [24]:
%%sql
select product_id,product_name,sale_date,sale_amount,
lead(sale_amount) over(order by sale_amount) as nextsale_amount,
lead(sale_amount) over(order by sale_amount) - sale_amount as difference
from product_sale;

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(1, 'mobile', datetime.date(2025, 9, 1), Decimal('500.00'), Decimal('600.00'), Decimal('100.00')),
 (1, 'mobile', datetime.date(2025, 9, 2), Decimal('600.00'), Decimal('700.00'), Decimal('100.00')),
 (1, 'mobile', datetime.date(2025, 9, 3), Decimal('700.00'), Decimal('800.00'), Decimal('100.00')),
 (1, 'mobile', datetime.date(2025, 9, 4), Decimal('800.00'), None, None)]

first value and last value

In [25]:
%%sql
select * from emp_salary_history;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', Decimal('60000.00')),
 (1, 'Alice', Decimal('65000.00')),
 (2, 'Bob', Decimal('75000.00')),
 (2, 'Bob', Decimal('80000.00')),
 (3, 'Charlie', Decimal('50000.00')),
 (3, 'Charlie', Decimal('55000.00'))]

In [26]:
%%sql
select *,
first_value(salary) over (partition by emp_id order by salary) as first_salary
from emp_salary_history;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', Decimal('60000.00'), Decimal('60000.00')),
 (1, 'Alice', Decimal('65000.00'), Decimal('60000.00')),
 (2, 'Bob', Decimal('75000.00'), Decimal('75000.00')),
 (2, 'Bob', Decimal('80000.00'), Decimal('75000.00')),
 (3, 'Charlie', Decimal('50000.00'), Decimal('50000.00')),
 (3, 'Charlie', Decimal('55000.00'), Decimal('50000.00'))]

In [28]:
%%sql
select *,
last_value(salary) over(partition by emp_id order by salary rows between current row and unbounded following) as current_salary
from emp_salary_history;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', Decimal('60000.00'), Decimal('65000.00')),
 (1, 'Alice', Decimal('65000.00'), Decimal('65000.00')),
 (2, 'Bob', Decimal('75000.00'), Decimal('80000.00')),
 (2, 'Bob', Decimal('80000.00'), Decimal('80000.00')),
 (3, 'Charlie', Decimal('50000.00'), Decimal('55000.00')),
 (3, 'Charlie', Decimal('55000.00'), Decimal('55000.00'))]

Nth value

In [29]:
%%sql
create table worker(
    emp_id int,
    emp_name varchar(50),
    dept varchar(20),
    salary decimal(20,2),
    salary_date date
    
);
insert into worker(emp_id,emp_name,dept,salary,salary_date) values
(1, 'Arun Kumar', 'HR', 45000.00, '2025-01-10'),
(2, 'Meena R', 'Marketing', 52000.00, '2025-01-15'),
(3, 'Karthik S', 'HR', 48000.00, '2025-02-05'),
(4, 'Priya M', 'Marketing', 60000.00, '2025-02-18'),
(5, 'Suresh K', 'HR', 47000.00, '2025-03-01'),
(6, 'Divya P', 'Marketing', 55000.00, '2025-03-12'),
(7, 'Rahul V', 'HR', 51000.00, '2025-04-02'),
(8, 'Anitha L', 'Marketing', 58000.00, '2025-04-15'),
(9, 'Vijay T', 'HR', 49500.00, '2025-05-05');

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
9 rows affected.

[]

In [30]:
%%sql
select * from worker

 * mysql+mysqlconnector://root:***@localhost/demo
9 rows affected.

[(1, 'Arun Kumar', 'HR', Decimal('45000.00'), datetime.date(2025, 1, 10)),
 (2, 'Meena R', 'Marketing', Decimal('52000.00'), datetime.date(2025, 1, 15)),
 (3, 'Karthik S', 'HR', Decimal('48000.00'), datetime.date(2025, 2, 5)),
 (4, 'Priya M', 'Marketing', Decimal('60000.00'), datetime.date(2025, 2, 18)),
 (5, 'Suresh K', 'HR', Decimal('47000.00'), datetime.date(2025, 3, 1)),
 (6, 'Divya P', 'Marketing', Decimal('55000.00'), datetime.date(2025, 3, 12)),
 (7, 'Rahul V', 'HR', Decimal('51000.00'), datetime.date(2025, 4, 2)),
 (8, 'Anitha L', 'Marketing', Decimal('58000.00'), datetime.date(2025, 4, 15)),
 (9, 'Vijay T', 'HR', Decimal('49500.00'), datetime.date(2025, 5, 5))]

In [31]:
%%sql
select *,
nth_value(salary,3) over(partition by dept order by salary desc
rows between unbounded preceding and unbounded following) as nth
from worker

 * mysql+mysqlconnector://root:***@localhost/demo
9 rows affected.

[(7, 'Rahul V', 'HR', Decimal('51000.00'), datetime.date(2025, 4, 2), Decimal('48000.00')),
 (9, 'Vijay T', 'HR', Decimal('49500.00'), datetime.date(2025, 5, 5), Decimal('48000.00')),
 (3, 'Karthik S', 'HR', Decimal('48000.00'), datetime.date(2025, 2, 5), Decimal('48000.00')),
 (5, 'Suresh K', 'HR', Decimal('47000.00'), datetime.date(2025, 3, 1), Decimal('48000.00')),
 (1, 'Arun Kumar', 'HR', Decimal('45000.00'), datetime.date(2025, 1, 10), Decimal('48000.00')),
 (4, 'Priya M', 'Marketing', Decimal('60000.00'), datetime.date(2025, 2, 18), Decimal('55000.00')),
 (8, 'Anitha L', 'Marketing', Decimal('58000.00'), datetime.date(2025, 4, 15), Decimal('55000.00')),
 (6, 'Divya P', 'Marketing', Decimal('55000.00'), datetime.date(2025, 3, 12), Decimal('55000.00')),
 (2, 'Meena R', 'Marketing', Decimal('52000.00'), datetime.date(2025, 1, 15), Decimal('55000.00'))]

union

In [32]:
%%sql
CREATE TABLE project (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    position    VARCHAR(50),
    salary      DECIMAL(10,2)
);

CREATE TABLE contractors (
    contractor_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name    VARCHAR(50),
    last_name     VARCHAR(50),
    position      VARCHAR(50),
    hourly_rate   DECIMAL(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.

[]

In [34]:
%%sql
INSERT INTO project (first_name, last_name, position, salary)
VALUES
('Alice', 'Smith', 'Developer', 70000.00),
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

INSERT INTO contractors (first_name, last_name, position, hourly_rate)
VALUES
('Dave', 'Williams', 'Developer', 40.00),
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.
3 rows affected.

[]

In [35]:
%%sql
select * from project
union 
select * from contractors

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', 'Smith', 'Developer', Decimal('70000.00')),
 (2, 'Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 (3, 'Charlie', 'Lee', 'Manager', Decimal('90000.00')),
 (1, 'Dave', 'Williams', 'Developer', Decimal('40.00')),
 (2, 'Eve', 'Brown', 'Tester', Decimal('35.00')),
 (3, 'Bob', 'Johnson', 'Developer', Decimal('45.00'))]

union all

In [37]:
%%sql
select * from project
union all
select * from contractors;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, 'Alice', 'Smith', 'Developer', Decimal('70000.00')),
 (2, 'Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 (3, 'Charlie', 'Lee', 'Manager', Decimal('90000.00')),
 (1, 'Dave', 'Williams', 'Developer', Decimal('40.00')),
 (2, 'Eve', 'Brown', 'Tester', Decimal('35.00')),
 (3, 'Bob', 'Johnson', 'Developer', Decimal('45.00'))]

In [40]:
%%sql
select  first_name from employees
union 
select first_name from contractors

 * mysql+mysqlconnector://root:***@localhost/demo
13 rows affected.

[('Alice',),
 ('Bob',),
 ('Charlie',),
 ('Diana',),
 ('Ethan',),
 ('Fiona',),
 ('George',),
 ('Hannah',),
 ('Ian',),
 ('Julia',),
 ('Kevin',),
 ('Dave',),
 ('Eve',)]

In [41]:
%%sql
select first_name from employees
union all
select first_name from contractors

 * mysql+mysqlconnector://root:***@localhost/demo
14 rows affected.

[('Alice',),
 ('Bob',),
 ('Charlie',),
 ('Diana',),
 ('Ethan',),
 ('Fiona',),
 ('George',),
 ('Hannah',),
 ('Ian',),
 ('Julia',),
 ('Kevin',),
 ('Dave',),
 ('Eve',),
 ('Bob',)]

index

In [42]:
%%sql
CREATE TABLE dummy (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name  VARCHAR(50) NOT NULL,
    last_name   VARCHAR(50) NOT NULL,
    email       VARCHAR(100) NOT NULL,
    city        VARCHAR(100) NOT NULL
);

CREATE INDEX idx_email ON dummy (email);


INSERT INTO dummy (first_name, last_name, email, city)
VALUES
('John', 'Doe', 'john@example.com', 'New York'),
('Jane', 'Smith', 'jane.smith@example.com', 'Los Angeles'),
('Michael', 'Brown', 'michael.brown@example.com', 'Chicago'),
('Emily', 'Johnson', 'emily.johnson@example.com', 'Houston'),
('Robert', 'Green', 'robert.green@example.com', 'Phoenix');

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [44]:
%%sql
select * from dummy where email='michael.brown@example.com'

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(3, 'Michael', 'Brown', 'michael.brown@example.com', 'Chicago')]

In [47]:
%%sql
explain
select * from dummy where email='michael.brown@example.com';

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(1, 'SIMPLE', 'dummy', None, 'ref', 'idx_email', 'idx_email', '402', 'const', 1, 100.0, None)]

In [48]:
%%sql
explain analyze
select * from dummy where email='michael.brown@example.com';

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[("-> Index lookup on dummy using idx_email (email='michael.brown@example.com')  (cost=0.35 rows=1) (actual time=0.0625..0.0668 rows=1 loops=1)\n",)]

partition

Range partition

In [62]:
%%sql
drop table if exists saran;
CREATE TABLE saran (
    order_id INT AUTO_INCREMENT ,
    order_date DATE NOT NULL,
    customer_name VARCHAR(50),
    amount DECIMAL(10,2),
    PRIMARY KEY(order_id, order_date)
)
PARTITION BY RANGE (YEAR(order_date)) (
    PARTITION p0 VALUES LESS THAN (2020),
    PARTITION p1 VALUES LESS THAN (2021),
    PARTITION p2 VALUES LESS THAN (2022),
    PARTITION p3 VALUES LESS THAN (2023),
    PARTITION pmax VALUES LESS THAN MAXVALUE
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.

[]

In [63]:
%%sql
INSERT INTO saran (order_date, customer_name, amount)
VALUES
('2019-05-10', 'Alice', 100.00),
('2020-01-15', 'Bob', 200.50),
('2020-12-01', 'Charlie', 300.00),
('2021-07-20', 'Diana', 150.75),
('2022-03-02', 'Edward', 500.00),
('2025-06-18', 'FutureMan', 9999.99);

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[]

In [74]:
%%sql
select * from saran

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, datetime.date(2019, 5, 10), 'Alice', Decimal('100.00')),
 (2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00')),
 (4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75')),
 (5, datetime.date(2022, 3, 2), 'Edward', Decimal('500.00')),
 (6, datetime.date(2025, 6, 18), 'FutureMan', Decimal('9999.99'))]

In [66]:
%%sql
SELECT 
    PARTITION_NAME,
    PARTITION_METHOD,
    PARTITION_EXPRESSION,
    SUBPARTITION_METHOD,
    SUBPARTITION_EXPRESSION
FROM information_schema.PARTITIONS
WHERE TABLE_SCHEMA = 'demo'
  AND TABLE_NAME   = 'saran';

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('pmax', 'RANGE', 'year(`order_date`)', None, None),
 ('p3', 'RANGE', 'year(`order_date`)', None, None),
 ('p2', 'RANGE', 'year(`order_date`)', None, None),
 ('p1', 'RANGE', 'year(`order_date`)', None, None),
 ('p0', 'RANGE', 'year(`order_date`)', None, None)]

In [75]:
%%sql
select * from saran where order_date='2021-07-20'

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75'))]

In [77]:
%%sql
explain 
select * from saran where order_date='2021-07-20'

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(1, 'SIMPLE', 'saran', 'p2', 'ALL', None, None, None, None, 1, 100.0, 'Using where')]

List partition

In [ ]:
%%sql
CREATE TABLE saran1 (
    employee_id INT AUTO_INCREMENT,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    department  VARCHAR(50),
    primary key (employee_id,department)
)
PARTITION BY LIST COLUMNS (department) (
    PARTITION p_sales       VALUES IN ('Sales'),
    PARTITION p_hr          VALUES IN ('HR'),
    PARTITION p_engineering VALUES IN ('Engineering', 'DevOps'),
    PARTITION p_other       VALUES IN ('Finance', 'Marketing', 'Operations')
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
(mysql.connector.errors.ProgrammingError) 1054 (42S22): Unknown column 'department' in 'field list'
[SQL: INSERT INTO employees (first_name, last_name, department)
VALUES
('Alice', 'Smith', 'Sales'),
('Bob', 'Johnson', 'HR'),
('Charlie', 'Lee', 'Engineering'),
('Diana', 'Lopez', 'DevOps'),
('Eve', 'Turner', 'Marketing');]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [80]:
%%sql
INSERT INTO saran1 (first_name, last_name, department)
VALUES
('Alice', 'Smith', 'Sales'),
('Bob', 'Johnson', 'HR'),
('Charlie', 'Lee', 'Engineering'),
('Diana', 'Lopez', 'DevOps'),
('Eve', 'Turner', 'Marketing');

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [81]:
%%sql
select * from saran1;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice', 'Smith', 'Sales'),
 (2, 'Bob', 'Johnson', 'HR'),
 (3, 'Charlie', 'Lee', 'Engineering'),
 (4, 'Diana', 'Lopez', 'DevOps'),
 (5, 'Eve', 'Turner', 'Marketing')]

In [85]:
%%sql
explain
select * from saran1 where department in('HR','Sales');

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(1, 'SIMPLE', 'saran1', 'p_sales,p_hr', 'ALL', None, None, None, None, 2, 50.0, 'Using where')]

Hash partition

In [86]:
%%sql

CREATE TABLE sensor_data (
    sensor_id     INT NOT NULL,
    reading_time  DATETIME NOT NULL,
    reading_value DECIMAL(10,2),
    PRIMARY KEY (sensor_id, reading_time)
)
PARTITION BY HASH(sensor_id)
PARTITIONS 2;

INSERT INTO sensor_data (sensor_id, reading_time, reading_value)
VALUES
(101, '2025-01-01 10:00:00', 23.50),
(102, '2025-01-01 10:05:00', 24.10),
(103, '2025-01-01 10:10:00', 22.75),
(104, '2025-01-01 10:15:00', 25.00),
(105, '2025-01-01 10:20:00', 20.00),
(106, '2025-01-01 10:25:00', 21.60);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
6 rows affected.

[]

In [91]:
%%sql
explain 
select * from  sensor_data where sensor_id = 105;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(1, 'SIMPLE', 'sensor_data', 'p1', 'ref', 'PRIMARY', 'PRIMARY', '4', 'const', 1, 100.0, None)]

sub parttion

In [94]:
%%sql
CREATE TABLE saran3 (
    order_id      INT AUTO_INCREMENT,
    order_date    DATE NOT NULL,
    customer_name VARCHAR(50),
    amount        DECIMAL(10,2),
    primary key(order_id, order_date)
)
PARTITION BY RANGE (YEAR(order_date)) 
SUBPARTITION BY HASH (MONTH(order_date))
SUBPARTITIONS 2 (
    PARTITION p_before_2020 VALUES LESS THAN (2020) (
        SUBPARTITION p0a,
        SUBPARTITION p0b
    ),
    PARTITION p_2020 VALUES LESS THAN (2021) (
        SUBPARTITION p1a,
        SUBPARTITION p1b
    ),
    PARTITION p_future VALUES LESS THAN MAXVALUE (
        SUBPARTITION p2a,
        SUBPARTITION p2b
    )
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [102]:
%%sql 
INSERT INTO saran3 (order_date, customer_name, amount) VALUES
('2018-05-12', 'Arun Kumar', 4500.00),   
('2019-11-20', 'Meena R', 5200.00),     
('2020-02-14', 'Karthik S', 6100.00),   
('2020-07-05', 'Priya M', 7000.00),     
('2021-03-18', 'Suresh K', 8000.00),    
('2022-08-09', 'Divya P', 9200.00),    
('2023-01-25', 'Rahul V', 10000.00);

 * mysql+mysqlconnector://root:***@localhost/demo
7 rows affected.

[]

In [103]:
%%sql
SELECT
    table_name, partition_name, subpartition_name, table_rows
FROM
    information_schema.PARTITIONS
WHERE
    table_name = 'saran3';

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[('saran3', 'p_2020', 'p1a', 1),
 ('saran3', 'p_2020', 'p1b', 2),
 ('saran3', 'p_before_2020', 'p0a', 0),
 ('saran3', 'p_before_2020', 'p0b', 2),
 ('saran3', 'p_future', 'p2a', 2),
 ('saran3', 'p_future', 'p2b', 4)]

partition with index

In [106]:

%%sql
CREATE TABLE saran4 (
    order_id      INT AUTO_INCREMENT ,
    order_date    DATE NOT NULL,
    customer_name VARCHAR(50),
    amount        DECIMAL(10,2),
    primary key(order_id, order_date)
)

PARTITION BY RANGE (YEAR(order_date)) (
    PARTITION p_before_2020 VALUES LESS THAN (2020),
    PARTITION p_2020       VALUES LESS THAN (2021),
    PARTITION p_2021       VALUES LESS THAN (2022),
    PARTITION p_2022       VALUES LESS THAN (2023),
    PARTITION p_future     VALUES LESS THAN MAXVALUE
);
CREATE INDEX idx_order_date ON orders (order_date);


INSERT INTO saran4 (order_date, customer_name, amount)
VALUES
('2019-05-10', 'Alice', 100.00),
('2020-01-15', 'Bob', 200.50),
('2020-12-01', 'Charlie', 300.00),
('2021-07-20', 'Diana', 150.75),
('2022-03-02', 'Edward', 500.00),
('2025-06-18', 'FutureMan', 9999.99);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.
6 rows affected.

[]

In [108]:
%%sql
select * from saran4;

 * mysql+mysqlconnector://root:***@localhost/demo
6 rows affected.

[(1, datetime.date(2019, 5, 10), 'Alice', Decimal('100.00')),
 (2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00')),
 (4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75')),
 (5, datetime.date(2022, 3, 2), 'Edward', Decimal('500.00')),
 (6, datetime.date(2025, 6, 18), 'FutureMan', Decimal('9999.99'))]

In [111]:
%%sql
SELECT *
FROM saran4
WHERE order_date BETWEEN '2020-01-01' AND '2021-12-31';

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00')),
 (4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75'))]